Revit 2027 API
BuiltInFailures.RebarFailures.RebarEndTreatmentOverCrank Property
 Cannot add end treatment to the end that already has a crank.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarEndTreatmentOverCrank { get; }
Public Shared ReadOnly Property RebarEndTreatmentOverCrank As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarEndTreatmentOverCrank {
	FailureDefinitionId^ get ();
}
static member RebarEndTreatmentOverCrank : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace